src/ru/BSL/TestIB/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <attributes>
    <name>TelegramID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/ru/BSL/TestIB/src/HTTPServices/Vitalik/Module.bsl
Функция maingetMessages(Запрос)
    
    Попытка
    // Достаем из ответа Telegram JSON и преобразуем его в Соответствие
    ТелоСтрока = Запрос.ПолучитьТелоКакСтроку();  
    ЧтениеJSON = Новый ЧтениеJSON;
    ЧтениеJSON.УстановитьСтроку(ТелоСтрока);
    
    Запрос = ПрочитатьJSON(ЧтениеJSON);

    ДанныеЗапроса  = ПолучитьСтруктуруПараметровИзСообщения(Запрос);
    ТекстСообщения = ДанныеЗапроса["ТекстСообщения"];
    IDПользователя = ДанныеЗапроса["ИдентификаторПользователя"];
    Статус         = ДанныеЗапроса["Статус"];
    Никнейм        = ДанныеЗапроса["Никнейм"];
    Пользователь   = ДанныеЗапроса["Пользователь"];
    
    // Если сообщение - начало диалога
    Если СтрНайти(ТекстСообщения, "/start") > 0 Тогда
        ОбработатьНачало(IDПользователя);
        
    // Если предварительно была нажата кнопка Создать тему
    ИначеЕсли Статус = 1 Тогда
        СоздатьТему(ТекстСообщения, Пользователь, IDПользователя);
        
    // Если предварительно была нажата кнопка Позови меня!
    ИначеЕсли Статус = 2 Тогда
        ПозватьПользователя(Никнейм, ТекстСообщения, Пользователь);    
    // Все остальное: кнопки и необрабатываемые сообщения
    Иначе
        ОбработатьСообщение(Пользователь, IDПользователя, ТекстСообщения);
    КонецЕсли;
    
    Исключение
    ОО = ОписаниеОшибки()
    КонецПопытки;
    Возврат Новый HTTPСервисОтвет(200);
    
КонецФункции

Функция ПолучитьСтруктуруПараметровИзСообщения(Знач Запрос)

    СтруктураПараметров = Новый Структура;
    
    // Получаем данные о нике, сообщении и ID из Telegram запроса
    Никнейм         = ?(Запрос.message.from.Свойство("username"), Запрос.message.from.username, "");
    ТекстСообщения  = ?(Запрос.message.Свойство("text"), Запрос.message.text, "");
    
    ИдентификаторПользователя = Запрос.message.from.id;
    ИдентификаторПользователя = OPI_Инструменты.ЧислоВСтроку(ИдентификаторПользователя);
    
    // Ищем существующего пользователя
    СуществующийПользователь  = Справочники.Пользователи.НайтиПоРеквизиту("TelegramID", ИдентификаторПользователя);
    
    // Создаем пользователя, если его нет
    Если Не ЗначениеЗаполнено(СуществующийПользователь) Тогда
        
        ОбъектПользователь = Справочники.Пользователи.СоздатьЭлемент();
        ОбъектПользователь.Наименование = Никнейм;
        ОбъектПользователь.TelegramID   = ИдентификаторПользователя;
        ОбъектПользователь.Записать();
        
        СуществующийПользователь = ОбъектПользователь.Ссылка;
        
    КонецЕсли;

    Статус = СуществующийПользователь.Статус;
    
    // Заполняем структуру
    СтруктураПараметров.Вставить("Пользователь"             , СуществующийПользователь);
    СтруктураПараметров.Вставить("ИдентификаторПользователя", ИдентификаторПользователя);
    СтруктураПараметров.Вставить("ТекстСообщения"           , ТекстСообщения);
    СтруктураПараметров.Вставить("Никнейм"                  , Никнейм);
    СтруктураПараметров.Вставить("Статус"                   , Статус);

    Возврат СтруктураПараметров;
    
КонецФункции

Процедура ОбработатьНачало(Знач IDПользователя)
    
    Токен       = Константы.Токен.Получить();
    ТекстОтвета = "Добро пожаловать! Выберите действие, которое хотите совершить";
    
    //Формируем клавиатуру
    Кнопки      = Новый Массив;
    Кнопки.Добавить("Новая тема");
    Кнопки.Добавить("Позови меня!");
    
    // Кнопки - массив кнопок
    // Ложь   - не под сообщением, а на панели
    // Истина - кнопки одна под одной, а не в ряд
    Клавиатура = OPI_Telegram.СформироватьКлавиатуруПоМассивуКнопок(Кнопки, Ложь, Истина);
    
    OPI_Telegram.ОтправитьТекстовоеСообщение(Токен, IDПользователя, ТекстОтвета, Клавиатура); 

КонецПроцедуры

Процедура СоздатьТему(Знач Имя, Знач Пользователь, Знач IDПользователя)
    
    Токен = Константы.Токен.Получить();
    Форум = Константы.IDГруппы.Получить();
    
    // Создаем тему
    Ответ     = OPI_Telegram.СоздатьТемуФорума(Токен, Форум, Имя, "5357419403325481346");
    
    // Получаем номер и приводим Число к строку
    Номер     = Ответ["result"]["message_thread_id"];
    Номер     = OPI_Инструменты.ЧислоВСтроку(Номер);
    
    // Отправляем ответ
    Сообщение = "Тема создана! Её номер - " + Номер;
    OPI_Telegram.ОтправитьТекстовоеСообщение(Токен, IDПользователя, Сообщение);
    
    // Сбрасываем статус
    ПользовательОбъект = Пользователь.ПолучитьОбъект();
    ПользовательОбъект.Статус = 0;
    ПользовательОбъект.Записать();

КонецПроцедуры

Процедура ПозватьПользователя(Знач Никнейм, Знач НомерТемы, Пользователь)
    
    Токен = Константы.Токен.Получить();
    Форум = Константы.IDГруппы.Получить();
    
    // Прибаляем номер темы к ID чата через *
    Чат   = Форум + "*" + НомерТемы;
    
    // Отправляем @Никнейм для упоминания пользователя
    OPI_Telegram.ОтправитьТекстовоеСообщение(Токен, Чат, "@" + Никнейм);
    
    // Сбрасываем статус
    ПользовательОбъект = Пользователь.ПолучитьОбъект();
    ПользовательОбъект.Статус = 0;
    ПользовательОбъект.Записать();

КонецПроцедуры

Процедура ОбработатьСообщение(Знач Пользователь, Знач IDПользователя, Знач ТекстСообщения)
    
    Токен = Константы.Токен.Получить();
    
    // Если Новая тема - ожидаем ввода названия
    Если ТекстСообщения = "Новая тема" Тогда
        
        ПользовательОбъект = Пользователь.ПолучитьОбъект();
        ПользовательОбъект.Статус = 1;
        ПользовательОбъект.Записать();
        ТекстОтвета = "Введите имя темы";
        
    // Если Позови меня! - ожидаем ввода номера темы
    ИначеЕсли ТекстСообщения = "Позови меня!" Тогда
        
        ПользовательОбъект = Пользователь.ПолучитьОбъект();
        ПользовательОбъект.Статус = 2;
        ПользовательОбъект.Записать();
        ТекстОтвета = "Введите номер темы";

    // Если нечто дургое
    Иначе 
        ТекстОтвета = "Я не знаю такой команды. Выберите что-нибудь на панели ниже";
    КонецЕсли;
    
    OPI_Telegram.ОтправитьТекстовоеСообщение(Токен, IDПользователя, ТекстОтвета);
    
КонецПроцедуры
